Revit 2027 API
ViewPrintingEventArgs.TotalViews Property
 The number of all views being printed.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int TotalViews { get; }
Public ReadOnly Property TotalViews As Integer
	Get
public:
property int TotalViews {
	int get ();
}
member TotalViews : int with get
Property Value
Int32
See Also
Reference
ViewPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace